Revit 2027 API
FamilyManager.Parameter Property
Obtains a parameter based on an identifier.
Overload List
Name | Description
Parameter[BuiltInParameter] | Obtains the parameter of this type with a given parameter id.
Parameter[Definition] | Obtains the parameter of this type with a given definition.
Parameter[Guid] | Obtains the parameter of this type with a given GUID for a shared parameter.
Parameter[String] | Obtains the parameter of this type with a given name.
Top
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace